---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTraySizeIterator.Dispose
source: html/dbcdd265-1bc2-2b01-35d1-7e246a4d2a83.htm
---
# Autodesk.Revit.DB.Electrical.CableTraySizeIterator.Dispose Method

Releases all resources used by the CableTraySizeIterator

## Syntax (C#)
```csharp
public void Dispose()
```